app/views/books/_index.html.erb

              <%= link_to book_favorites_path(book), method: :delete do %>
                ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

              <%= link_to book_favorites_path(book), method: :post do %>
                ♡<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

          <% end %>
        <td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]