app/views/books/_index.html.erb

SELECT "books".* FROM "books"
---
        <td class="favorite-btn_<%= book.id %>"><%= render "favorites/favorite-btn", book: book %></td>
        <td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>