app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "いいね"], ["user_id", 2], ["book_id", 1], ["created_at", "2021-02-03 06:47:20.257570"], ["updated_at", "2021-02-03 06:47:20.257570"]]
---
  def create
    @book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    if comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 12]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" IS NULL AND "book_comments"."book_id" = ? LIMIT ?  [["book_id", 10], ["LIMIT", 1]]
---
  def destroy
    @book_comment = BookComment.find(params[:book_id]).destroy