app/controllers/books_controller.rb

  def show
    @book_new = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] ="You have created book successfully."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "railsの基礎学習"], ["body", "aaa"], ["user_id", 1], ["created_at", "2021-02-03 01:52:21.704378"], ["updated_at", "2021-02-03 01:52:21.704378"]]
SELECT "books".* FROM "books"